zup/ЗУП_бюджет/src/Enums/ВидыКадровыхОперацийВоеннослужащих/ВидыКадровыхОперацийВоеннослужащих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКадровыхОперацийВоеннослужащих</name>
  <enumValues>
    <name>КадровыйПеревод</name>
  </enumValues>
  <enumValues>
    <name>ВступлениеВДолжность</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтДолжности</name>
  </enumValues>
  <enumValues>
    <name>ПереводСПризываНаКонтракт</name>
  </enumValues>
  <enumValues>
    <name>ПереводСтажераНаКонтракт</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ВидыКадровыхОперацийВоеннослужащих/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Ссылка") Тогда
		Параметры.Отбор.Вставить("Ссылка", ДоступныеВидыОпераций());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ДоступныеВидыОпераций() Экспорт
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.КадровыйПеревод);
	ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ВступлениеВДолжность);
	ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ОсвобождениеОтДолжности);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоДовольствияВоеннослужащихПоПризыву") Тогда
		ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ПереводСПризываНаКонтракт);
	КонецЕсли; 
	
	Если ПолучитьФункциональнуюОпцию("НеИспользоватьРасчетДенежногоДовольствияВоеннослужащих") Тогда
		ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ПереводСтажераНаКонтракт);
	КонецЕсли; 
	
	Возврат ВидыОпераций;
	
КонецФункции

#КонецОбласти
